docs/adding-entities.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-11-26 Sun 20:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jeff Romine" />
</head>
<body>
<div id="content">
<p>
There are two kinds of entities so far in our app, donations and users.  The user REST API is under localhost:3001/api/users.
</p>

<p>
Creating a user.  It is possible to create a user by posting to <a href="http://localhost:3001/api/users">http://localhost:3001/api/users</a>. For example:
</p>

<div class="org-src-container">
<pre class="src src-shell-script">curl -X POST <span style="color: #CC9393;">\</span>
  http://localhost:3001/api/users <span style="color: #CC9393;">\</span>
  -H <span style="color: #CC9393;">'cache-control: no-cache'</span> <span style="color: #CC9393;">\</span>
  -H <span style="color: #CC9393;">'content-type: application/json'</span> <span style="color: #CC9393;">\</span>
  -d <span style="color: #CC9393;">'</span>
<span style="color: #CC9393;">{</span>
<span style="color: #CC9393;">"firstName": "Joe",</span>
<span style="color: #CC9393;">  "lastName": "Brewmaster",</span>
<span style="color: #CC9393;">  "organization": "Red Rock Brewery",</span>
<span style="color: #CC9393;">  "addressStreet": "6227 State St",</span>
<span style="color: #CC9393;">  "addressCity": "Murray",</span>
<span style="color: #CC9393;">  "addressState": "UT",</span>
<span style="color: #CC9393;">  "addressZip": "84107",</span>
<span style="color: #CC9393;">  "type": "donor",</span>
<span style="color: #CC9393;">  "email": "joe@redrock.com",</span>
<span style="color: #CC9393;">  "phone": "(555) 555-5555"</span>
<span style="color: #CC9393;">}</span>

<span style="color: #CC9393;">'</span>
</pre>
</div>

<p>
You can get listing of users by doing a GET on
<a href="http://localhost:3001/api/users">http://localhost:3001/api/users</a>.  This is as easy as opening this link
in a browser or using curl:
</p>

<div class="org-src-container">
<pre class="src src-shell-script">curl -X GET <span style="color: #CC9393;">\</span>
  http://localhost:3001/api/users <span style="color: #CC9393;">\</span>
  -H <span style="color: #CC9393;">'cache-control: no-cache'</span> <span style="color: #CC9393;">\</span>
  -H <span style="color: #CC9393;">'content-type: application/json'</span>
</pre>
</div>


<p>
Donations work pretty much the same way but using /api/users.  Here is how you would add a donation using curl:
</p>

<div class="org-src-container">
<pre class="src src-shell-script">curl -X POST <span style="color: #CC9393;">\</span>
  http://localhost:3001/api/donations <span style="color: #CC9393;">\</span>
  -H <span style="color: #CC9393;">'cache-control: no-cache'</span> <span style="color: #CC9393;">\</span>
  -H <span style="color: #CC9393;">'content-type: application/json'</span> <span style="color: #CC9393;">\</span>
   -d <span style="color: #CC9393;">'{</span>
<span style="color: #CC9393;">  "productName": "fried chicken",</span>
<span style="color: #CC9393;">  "productQuantity": 10,</span>
<span style="color: #CC9393;">  "productUnit": "lbs",</span>
<span style="color: #CC9393;">  "donorId": 1,</span>
<span style="color: #CC9393;">  "expiration": "2017-11-15T15:50:46.301Z",</span>
<span style="color: #CC9393;">  "comments": "",</span>
<span style="color: #CC9393;">  "status": "available",</span>
<span style="color: #CC9393;">  "tags":["protein","chicken"]</span>
<span style="color: #CC9393;">}</span>
<span style="color: #CC9393;">'</span>
</pre>
</div>

<p>
Make sure that donorId refers to the id of one of the users.  There is
also a receiverId which you can point at a user with type "recipient".
If there is a recipient the donation status should probably be
"reserved" or "recieved".  These things don't actually mean anything
yet, except for the donorId since that is used to look up the location,
 but we should try to be somewhat consistent.
</p>


<p>
In React code you should make these calls through the API object in FEEDITFORWARD/client/utils/API.js.  Here is an example:
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #F0DFAF; font-weight: bold;">import</span> React, { Component } from <span style="color: #CC9393;">"react"</span>;
<span style="color: #F0DFAF; font-weight: bold;">import</span> API from <span style="color: #CC9393;">"../utils/API"</span>;
<span style="color: #F0DFAF; font-weight: bold;">import</span> {List} from <span style="color: #CC9393;">"../components/List/List"</span>;
<span style="color: #F0DFAF; font-weight: bold;">import</span> {ListItem} from <span style="color: #CC9393;">"../components/List/ListItem"</span>;

<span style="color: #F0DFAF; font-weight: bold;">class</span> Landing <span style="color: #F0DFAF; font-weight: bold;">extends</span> Component {
  state = {
    donations: []
  };

  componentDidMount() {
    API.getDonations()
      .then(res =&gt; {
          <span style="color: #BFEBBF;">this</span>.setState(
            {
              donations: res.data
            });
        }
      )
      .<span style="color: #F0DFAF; font-weight: bold;">catch</span>(err =&gt; console.log(err));
  };

  handleInputChange = event =&gt; {
  };

  render = () =&gt;
    &lt;List&gt;
      {<span style="color: #BFEBBF;">this</span>.state.donations.map(donation =&gt; (
        &lt;ListItem key={donation._id}&gt;
            &lt;pre&gt;
              {JSON.stringify(donation,<span style="color: #BFEBBF;">null</span>,2)}
            &lt;/pre&gt;
        &lt;/ListItem&gt;
      ))}
    &lt;/List&gt;
}

<span style="color: #F0DFAF; font-weight: bold;">export</span> <span style="color: #F0DFAF; font-weight: bold;">default</span> Landing;

</pre>
</div>

<p>
Unfortunately, only a couple of calls are current available through
API.js.  I will be working next on adding the rest of the calls that
are implemented in the back end.
</p>

<p>
API.js isn't very complicated. Here is the current version:
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #F0DFAF; font-weight: bold;">const</span> <span style="color: #DFAF8F;">searchDonations</span> = query  =&gt; {
  <span style="color: #F0DFAF; font-weight: bold;">const</span> <span style="color: #DFAF8F;">queryComponent</span> = {
    <span style="color: #CC9393;">"bool"</span>: Object.assign({
        <span style="color: #CC9393;">"filter"</span>: {
          <span style="color: #CC9393;">"geo_distance"</span>: {
            <span style="color: #CC9393;">"distance"</span>: <span style="color: #CC9393;">"1000mi"</span>,
            <span style="color: #CC9393;">"location"</span>: {
              <span style="color: #CC9393;">"lat"</span>: 40.5680304,
              <span style="color: #CC9393;">"lon"</span>: -111.8500344
            }
          }
        }
      },
      {<span style="color: #CC9393;">"must"</span>: query})
  };
  <span style="color: #F0DFAF; font-weight: bold;">return</span> axios.post(<span style="color: #CC9393;">'/api/search/feed-it-forward-donations'</span>,
    {
      <span style="color: #CC9393;">"query"</span>: queryComponent,
      <span style="color: #CC9393;">"sort"</span>: [
        {
          <span style="color: #CC9393;">"_geo_distance"</span>: {
            <span style="color: #CC9393;">"location"</span> : {
              <span style="color: #CC9393;">"lat"</span>: 40.5680304,
              <span style="color: #CC9393;">"lon"</span>: -111.8500344
            },
            <span style="color: #CC9393;">"order"</span>:         <span style="color: #CC9393;">"asc"</span>,
            <span style="color: #CC9393;">"unit"</span>:          <span style="color: #CC9393;">"mi"</span>,
            <span style="color: #CC9393;">"distance_type"</span>: <span style="color: #CC9393;">"arc"</span>
          }
        }
      ],
      <span style="color: #CC9393;">"aggs"</span> : {
        <span style="color: #CC9393;">"tags"</span>: {
          <span style="color: #CC9393;">"terms"</span>: {<span style="color: #CC9393;">"field"</span>: <span style="color: #CC9393;">"tags"</span>}
        }
      }
    });
};

<span style="color: #F0DFAF; font-weight: bold;">export</span> <span style="color: #F0DFAF; font-weight: bold;">default</span> {
  getDonations() {
    <span style="color: #F0DFAF; font-weight: bold;">return</span> axios.get(<span style="color: #CC9393;">'/api/donations'</span>);
  },
  searchAllDonations() {
    <span style="color: #F0DFAF; font-weight: bold;">return</span> searchDonations(
      {
        <span style="color: #CC9393;">"match_all"</span>: {}
      }
    );
  },
  searchDonations: searchDonations
};
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jeff Romine</p>
<p class="date">Created: 2017-11-26 Sun 20:00</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
